app/controllers/bands_controller.rb

  def show
    @reviews = Review.where(band_id: @band.id).order("created_at DESC")

    if @reviews.blank?
      @avg_review = 0
      @no_image = true
    else
      @avg_review = @reviews.average(:rating).round(2)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."band_id" = ?  ORDER BY created_at DESC  [["band_id", 2]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."band_id" = ?  [["band_id", 2]]

  def create
    @band = current_user.bands.build(band_params)

    respond_to do |format|
      if @band.save
---
INSERT INTO "bands" ("title", "description", "band_members", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Pantera"], ["description", "test"], ["band_members", "edn pa edn pa edn"], ["rating", "10"], ["created_at", "2016-02-29 12:14:24.262668"], ["updated_at", "2016-02-29 12:14:24.262668"]]

  def update
    respond_to do |format|
      if @band.update(band_params)
---
UPDATE "bands" SET "title" = ?, "description" = ?, "band_members" = ?, "rating" = ?, "updated_at" = ? WHERE "bands"."id" = ?  [["title", ""], ["description", ""], ["band_members", ""], ["rating", ""], ["updated_at", "2016-03-06 21:24:55.045087"], ["id", 3]]

    def set_band
      @band = Band.find(params[:id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT 1  [["id", 2]]