app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("rating", "comment", "user_id", "band_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 3], ["comment", "323"], ["user_id", 1], ["band_id", 2], ["created_at", "2016-03-06 19:36:01.174659"], ["updated_at", "2016-03-06 19:36:01.174659"]]
---
  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    @review.band_id = @band.id
      if @review.save

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_band
      @band = Band.find(params[:band_id])